Autodesk.Navisworks.Api.ModelGeometry
Represents geometry within the model hierarchy

Autodesk.Navisworks.Api.ModelGeometry.ActiveColor
Current (visible) color for this geometry
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelGeometry.ActiveTransform
Returns the currently active transform of the geometry.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelGeometry.ActiveTransparency
Current (visible) transparency for this geometry
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelGeometry.BoundingBox
Bounding box of this geometry in world space
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelGeometry.Equals(System.Object)
Determines whether the specified object and the current object refer to the same
underlying native object. Returns false if either object has been disposed.

Autodesk.Navisworks.Api.ModelGeometry.FragmentCount
Number of fragments this geometry is divided into
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelGeometry.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.ModelGeometry.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.ModelGeometry.IsSolid
Is this geometry solid ? (Includes triangle primitives which all form closed, manifold shells)
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelGeometry.Item
Item in the model hierarchy corresponding to this geometry
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelGeometry.OriginalColor
Original color for this geometry (as specified by design file)
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelGeometry.OriginalTransform
Returns the original transform of the geometry when it was loaded.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelGeometry.OriginalTransparency
Original transparency for this geometry (as specified by design file)
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelGeometry.PermanentColor
Permanent color for geometry. Either original color or color explicitly overriden by user.

Autodesk.Navisworks.Api.ModelGeometry.PermanentOverrideTransform
Transform applied to the original transform of the model geometry.

Autodesk.Navisworks.Api.ModelGeometry.PermanentTransform
Permanent transform for the model geometry.
The transform formed as a result of combining the original transform with the override transform.

Autodesk.Navisworks.Api.ModelGeometry.PermanentTransparency
Permanent transparency for geometry.
Either original transparency or transparency explicitly overriden by user.

Autodesk.Navisworks.Api.ModelGeometry.PrimitiveCount
Number of primitives (triangles,lines,points) that define this geometry
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelGeometry.PrimitiveTypes
Types of primitives used to define this geometry
Throws System.ObjectDisposedException:
Object has been Disposed